Revit 2027 API
MEPSection.FrictionFactor Property
 The friction factor of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FrictionFactor { get; }
Public ReadOnly Property FrictionFactor As Double
	Get
public:
property double FrictionFactor {
	double get ();
}
member FrictionFactor : float with get
Property Value
Double
Remarks
 Friction Factor is a number. The friction factor type is UT_Number.
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace